{
  "nav": {
    "images": "Load and enhance image volumes (ND2, TIFF, MAT, NPY, DICOM)",
    "mask": "Define region-of-interest masks to exclude areas from tracking",
    "detection": "Preview and tune particle detection parameters",
    "parameters": "Configure tracking solver, matching, and trajectory parameters",
    "analysis": "Run the full tracking analysis with live progress",
    "postprocess": "Compute displacement, velocity, and strain fields from tracking results",
    "stress": "Convert strain fields to stress using constitutive models",
    "plots": "Generate publication-quality plots and export figures"
  },
  "images_page": {
    "btn_load_files": "Open a file dialog to select individual image files (ND2, TIFF, MAT, NPY, DICOM)",
    "btn_load_folder": "Load all supported images from a folder as a time series",
    "method_combo": "Select an image enhancement method to add to the processing pipeline",
    "btn_add_step": "Add the selected enhancement method with current parameters to the pipeline",
    "btn_remove_step": "Remove the currently selected step from the enhancement pipeline",
    "btn_clear_pipeline": "Remove all steps from the enhancement pipeline",
    "btn_run_enhance": "Apply the enhancement pipeline to all loaded volumes",
    "btn_revert": "Discard enhancements and revert to original loaded images",
    "z_slider": "Navigate through Z-slices of 3D volume data",
    "t_slider": "Navigate through time points in the image series",
    "cmap_combo": "Select colormap for image display"
  },
  "mask_page": {
    "mask_type": "Choose how to define the mask: rectangular ROI, polygon, or threshold-based",
    "x_from": "Starting X coordinate of the rectangular ROI (pixels)",
    "x_to": "Ending X coordinate of the rectangular ROI (pixels)",
    "y_from": "Starting Y coordinate of the rectangular ROI (pixels)",
    "y_to": "Ending Y coordinate of the rectangular ROI (pixels)",
    "z_from": "Starting Z slice of the rectangular ROI (for 3D data)",
    "z_to": "Ending Z slice of the rectangular ROI (for 3D data)",
    "btn_apply_mask": "Apply the current mask settings",
    "btn_clear_mask": "Reset the mask to include the full image"
  },
  "detection_page": {
    "method": "Detection algorithm: TracTrac uses LoG blobs, TPT uses radial symmetry",
    "threshold": "Intensity threshold for particle detection (0–1 normalized). Lower = more detections",
    "bead_radius": "Expected particle radius in pixels. Affects sub-pixel localization",
    "min_size": "Minimum blob size in pixels to accept as a particle",
    "max_size": "Maximum blob size in pixels. Larger blobs are rejected as aggregates",
    "color": "Particle brightness: 'white' for bright particles on dark background",
    "btn_detect": "Run detection on the currently displayed frame to preview results",
    "btn_detect_all": "Run detection on all frames (useful for checking consistency)"
  },
  "parameters_page": {
    "mode": "Tracking mode: Incremental (frame-to-frame), Cumulative (all-to-reference), or Double Frame",
    "f_o_s": "Field of search radius in pixels. Limits max displacement per frame",
    "n_neighbors_max": "Maximum neighbors for topology matching. More = slower but more robust",
    "n_neighbors_min": "Minimum neighbors required for a valid topology match",
    "loc_solver": "Local matching method: Topology-based or Histogram-then-Topology",
    "solver": "Global solver: MLS (fast), Regularization (balanced), ADMM (robust)",
    "smoothness": "Regularization smoothness parameter. Higher = smoother displacement field",
    "outlier_threshold": "Westerweel universal outlier test threshold. Lower = stricter filtering",
    "max_iter": "Maximum ADMM iterations per frame",
    "iter_stop_threshold": "Convergence criterion for ADMM iterations",
    "strain_n_neighbors": "Number of neighbors for strain gauge computation",
    "strain_f_o_s": "Field of search for strain neighbor identification",
    "use_prev_results": "Initialize from previous frame results for faster convergence",
    "dist_missing": "Distance threshold for marking particles as missing between frames",
    "xstep": "Physical pixel size in X direction (µm/pixel)",
    "ystep": "Physical pixel size in Y direction (µm/pixel)",
    "zstep": "Physical pixel size in Z direction (µm/pixel)",
    "tstep": "Time between frames (seconds)",
    "traj_dist_threshold": "Distance threshold for merging broken trajectory segments (pixels)",
    "traj_extrap_method": "Extrapolation method for trajectory merging: 'pchip' (smooth) or 'nearest' (Brownian)",
    "traj_min_segment": "Minimum trajectory segment length to attempt merging (frames)",
    "traj_max_gap": "Maximum frame gap allowed when connecting trajectory segments",
    "traj_merge_passes": "Number of trajectory merge passes (more = more segments connected)"
  },
  "analysis_page": {
    "btn_run": "Start the tracking analysis using current images, detection, and parameter settings",
    "btn_cancel": "Cancel the running analysis (results computed so far are kept)",
    "cb_concurrent_pp": "Run post-processing as tracking data becomes available (experimental)"
  },
  "postprocess_page": {
    "grid_step": "Grid spacing for scatter-to-grid interpolation (pixels). Smaller = finer but noisier",
    "smoothness": "Regularization smoothness for gridding. Higher values produce smoother fields",
    "xstep": "Physical X pixel size (µm/px) for velocity computation",
    "ystep": "Physical Y pixel size (µm/px) for velocity computation",
    "zstep": "Physical Z pixel size (µm/px) for velocity computation",
    "tstep": "Time step between frames (seconds) for velocity computation",
    "max_disp_threshold": "Maximum displacement threshold (px). Larger displacements removed as outliers",
    "max_velocity_threshold": "Maximum velocity threshold (µm/s). Larger velocities are flagged",
    "cb_displacement": "Compute and output displacement fields",
    "cb_velocity": "Compute and output velocity fields",
    "cb_strain": "Compute and output infinitesimal strain tensor fields",
    "cb_def_grad": "Compute and output deformation gradient tensor F",
    "btn_run": "Run post-processing on tracking results to compute fields",
    "sb_frame": "Select which frame to visualize",
    "cb_view": "Select which field component to display"
  },
  "stress_page": {
    "cb_model": "Constitutive model: Linear Elastic, Neo-Hookean, or Mooney-Rivlin",
    "youngs_modulus": "Young's modulus E in Pa (e.g., ~1000 for soft hydrogels, ~200e9 for steel)",
    "poisson_ratio": "Poisson's ratio ν (typically 0.3–0.5; use ~0.45–0.5 for nearly incompressible materials)",
    "shear_modulus": "Shear modulus μ = E/(2(1+ν)). Initial shear modulus for hyperelastic models",
    "bulk_modulus": "Bulk modulus κ = E/(3(1-2ν)). Resistance to volumetric change",
    "C10": "First Mooney-Rivlin constant (≈ μ/2 for consistency with neo-Hookean)",
    "C01": "Second Mooney-Rivlin constant. Set to 0 to reduce to neo-Hookean model",
    "btn_load_mat": "Load material properties from a JSON file",
    "btn_save_mat": "Save current material properties to a JSON file for reuse",
    "btn_fill": "Fill the anisotropic stiffness matrix from current E and ν values",
    "btn_run": "Compute stress from post-processed strain data using selected constitutive model",
    "sb_frame": "Select which frame to preview stress results",
    "cb_view": "Select stress component or Von Mises equivalent to display"
  },
  "plots_page": {
    "cb_source": "Data source for plotting: displacement, velocity, strain, stress, or trajectories",
    "cb_component": "Component or projection to display from the selected data source",
    "sb_frame": "Frame index to display",
    "sl_z": "Z-slice index for 3D datasets. Drag to navigate through depth",
    "cb_plot_type": "Plot rendering type: heatmap, contour, quiver/vector overlay",
    "sb_quiver_skip": "Quiver density: show every Nth vector. Higher = sparser vectors",
    "dsb_quiver_scale": "Vector length scaling factor. Larger = shorter vectors on screen",
    "sb_contour_levels": "Number of contour levels for contour plots",
    "cb_cmap_cat": "Colormap category: Sequential, Diverging, or Perceptual",
    "cb_cmap": "Specific colormap within the selected category",
    "chk_reverse": "Reverse the colormap direction",
    "chk_auto_range": "Automatically compute colorbar range from data (2nd–98th percentile)",
    "dsb_vmin": "Manual minimum value for colorbar range (when auto range is off)",
    "dsb_vmax": "Manual maximum value for colorbar range (when auto range is off)",
    "le_title": "Custom plot title. Leave empty for auto-generated title",
    "le_xlabel": "X-axis label text",
    "le_ylabel": "Y-axis label text",
    "le_cbar_label": "Colorbar label text. Leave empty for auto label",
    "chk_grid": "Show grid lines on the plot",
    "sb_dpi": "Export resolution in dots per inch. 300 DPI for print quality",
    "cb_format": "Export file format: PNG, SVG, PDF, TIFF, or EPS",
    "btn_export": "Export the current plot view to a file",
    "btn_export_all": "Export the current view for every frame to a folder",
    "btn_refresh": "Refresh the plot with current settings",
    "sb_font_size": "Font size for axis labels and titles",
    "cb_font_family": "Font family for text in plots"
  },
  "experiments": {
    "btn_new": "Create a new experiment. Each experiment has its own settings and results",
    "btn_save": "Save all experiments to a session file (.stk) for later recall",
    "btn_load": "Load a previously saved session file to resume work",
    "list": "Click an experiment to switch to it. Right-click for rename/duplicate/delete"
  }
}